astb_relise/src/DataProcessors/УстановкаСоответствияПравильнымГОСТам/УстановкаСоответствияПравильнымГОСТам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УстановкаСоответствияПравильнымГОСТам</name>
  <attributes>
    <name>ФайлЗагрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

astb_relise/src/InformationRegisters/ПравильныеГОСТы/ПравильныеГОСТы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПравильныеГОСТы</name>
  <dimensions>
    <name>НеПравильныйГОСТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПравильныйГОСТ</name>
    <type>
      <types>CatalogRef.ГОСТы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/DataProcessors/УстановкаСоответствияПравильнымГОСТам/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ФайлЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НастройкиДиалога = Новый Структура;
	НастройкиДиалога.Вставить("Фильтр", НСтр("ru = 'Документ MS EXCEL(*.xls)|*.xls'"));
	НастройкиДиалога.Вставить("ПроверятьСуществованиеФайла", Истина);
	
	ОбменДаннымиКлиент.ОбработчикВыбораФайла(Объект,"ФайлЗагрузки",СтандартнаяОбработка, НастройкиДиалога);
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлЗагрузкиОткрытие(Элемент, СтандартнаяОбработка)
	
	ОбменДаннымиКлиент.ОбработчикОткрытияФайлаИлиКаталога(Объект,"ФайлЗагрузки",СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ФайлЗагрузки) Тогда
		Сообщить("Не задан файл для загрузки!");
	КонецЕсли;
	
	ЗагрузитьДанныеНаСервере();
	
	Сообщить("Загрузка данных завершена!");
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеНаСервере()
	
	Попытка
		xl 				= Новый COMОбъект("Excel.Application");  
		Книга 			= xl.Application.Workbooks.Open(Объект.ФайлЗагрузки);
		ТекущийЛист 	= Книга.WorkSheets(1);
		КоличествоСтрок = ТекущийЛист.Cells(1,1).SpecialCells(11).Row;
	Исключение
		Сообщить("Не удалось открыть файл в Excel");
	КонецПопытки;
	
	//очистим старые записи по норме
	НаборЗаписей = РегистрыСведений.ПравильныеГОСТы.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
	Для Сч = 2 По КоличествоСтрок Цикл 
		
		НеПравильныйГОСТ 	= СокрЛП(ТекущийЛист.Cells(Сч, 2).Value);
		ПравильныйГОСТ 		= Справочники.ГОСТы.НайтиПоКоду(СокрЛП(ТекущийЛист.Cells(Сч, 1).Value));
		
		Если ПравильныйГОСТ.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.ПравильныеГОСТы.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.НеПравильныйГОСТ.Установить(НеПравильныйГОСТ);
		НаборЗаписей.Отбор.ПравильныйГОСТ.Установить(ПравильныйГОСТ);
		НаборЗаписей.Прочитать();
		
		НоваяЗапись 			 		= НаборЗаписей.Добавить();
		НоваяЗапись.НеПравильныйГОСТ 	= НеПравильныйГОСТ;
		НоваяЗапись.ПравильныйГОСТ 		= ПравильныйГОСТ;
		
		Попытка
			НаборЗаписей.Записать();
		Исключение
            Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	xl.WorkBooks.Close(); 
	xl = 0;

КонецПроцедуры
